# NoDefaultType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ElementTypeFailures..::..NoDefaultType Property
BuiltInFailures..::..ElementTypeFailures Class See Also
---
As a result of Reloading Latest, there are no types of [User Name] left. Create a new type by duplicating an existing [User Name] type in the Project Browser.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId NoDefaultType { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property NoDefaultType As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ NoDefaultType {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ElementTypeFailures Class
Autodesk.Revit.DB Namespace